{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "## Windows Virtual Desktop"
      },
      "name": "text - 2"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "12ee4b9a-96a1-4439-8b87-7f503e24ce78",
            "version": "KqlParameterItem/1.0",
            "name": "Subscription",
            "type": 6,
            "isRequired": true,
            "value": "",
            "typeSettings": {
              "additionalResourceOptions": [],
              "includeAll": true
            },
            "resourceType": "microsoft.insights/components"
          },
          {
            "id": "a92547c7-0c8d-40b9-b527-7b1b3dfd826f",
            "version": "KqlParameterItem/1.0",
            "name": "Workspace",
            "type": 5,
            "isRequired": true,
            "query": "where type =~ 'microsoft.operationalinsights/workspaces'\r\n| project id",
            "crossComponentResources": [
              "{Subscription}"
            ],
            "value": "",
            "typeSettings": {
              "resourceTypeFilter": {
                "microsoft.operationalinsights/workspaces": true
              },
              "additionalResourceOptions": []
            },
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "2e36397a-ad0a-4b82-a6fe-bf1121bfda92",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "type": 4,
            "isRequired": true,
            "value": {
              "durationMs": 604800000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 300000
                },
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 1800000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ],
              "allowCustom": true
            },
            "resourceType": "microsoft.insights/components"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 3"
    },
    {
      "type": 1,
      "content": {
        "json": "## Connections"
      },
      "name": "text - 9 - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "WVDConnections\r\n| summarize dcount(CorrelationId) by bin(TimeGenerated, 1d)",
        "size": 1,
        "title": "Connections per Day",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "visualization": "timechart",
        "sortBy": []
      },
      "customWidth": "70",
      "name": "query - 2 - Copy - Copy - Copy - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "WVDConnections \r\n| where State =~ \"Started\" and Type =~\"WVDConnections\" \r\n| extend CState=iff(SessionHostOSVersion==\"<>\",\"Failure\",\"Success\") | summarize Count=count() by State=CState\r\n| render piechart ",
        "size": 1,
        "title": "Count of brokered sessions by state",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "customWidth": "30",
      "name": "query - 17"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "WVDConnections\r\n|sort by TimeGenerated asc, CorrelationId ",
        "size": 1,
        "title": "Connections",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "gridSettings": {
          "filter": true
        }
      },
      "name": "query - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "//To get a list of connections made by your users\r\n\r\nWVDConnections \r\n| project-away TenantId,SourceSystem \r\n| summarize arg_max(TimeGenerated, *), StartTime =  min(iff(State== 'Started', TimeGenerated , datetime(null) )), ConnectTime = min(iff(State== 'Connected', TimeGenerated , datetime(null) ))   by CorrelationId \r\n| join kind=leftouter ( \r\n    WVDErrors \r\n    |summarize Errors=makelist(pack('Code', Code, 'CodeSymbolic', CodeSymbolic, 'Time', TimeGenerated, 'Message', Message ,'ServiceError', ServiceError, 'Source', Source)) by CorrelationId \r\n    ) on CorrelationId     \r\n| join kind=leftouter ( \r\n   WVDCheckpoints \r\n   | summarize Checkpoints=makelist(pack('Time', TimeGenerated, 'Name', Name, 'Parameters', Parameters, 'Source', Source)) by CorrelationId \r\n   | mv-apply Checkpoints on \r\n    ( \r\n        order by todatetime(Checkpoints['Time']) asc \r\n        | summarize Checkpoints=makelist(Checkpoints) \r\n    ) \r\n   ) on CorrelationId \r\n| project-away CorrelationId1, CorrelationId2 \r\n| order by  TimeGenerated desc ",
        "size": 1,
        "title": "Connections Completed by Users",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "gridSettings": {
          "filter": true,
          "sortBy": [
            {
              "itemKey": "CorrelationId",
              "sortOrder": 1
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "CorrelationId",
            "sortOrder": 1
          }
        ]
      },
      "name": "query - 2 - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "WVDConnections \r\n| where State =~ \"Started\" and Type =~\"WVDConnections\" \r\n| extend Multi=split(_ResourceId, \"/\") | extend CState=iff(SessionHostOSVersion==\"<>\",\"Failure\",\"Success\")\r\n| where CState=~\"Failure\" \r\n| project TimeStamp=TimeGenerated, UserName, ResourceGroup=Multi[4], HostPool=Multi[8],ResourceAlias, SessionHost=SessionHostName, ClientOS=ClientOS, ClientWvdVersion=ClientVersion, CorrelationId\r\n| order by TimeStamp desc",
        "size": 0,
        "title": "Failed Connections",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 14 - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "//Failed connection with details\r\nWVDConnections | where State =~ \"Started\" and Type =~\"WVDConnections\" \r\n| extend Multi=split(_ResourceId, \"/\") | extend CState=iff(SessionHostOSVersion==\"<>\",\"Failure\",\"Success\")\r\n| where CState =~\"Failure\"\r\n| order by TimeGenerated desc\r\n| where State =~ \"Started\" | extend Multi=split(_ResourceId, \"/\") \r\n| project ResourceAlias, ResourceGroup=Multi[4], HostPool=Multi[8], SessionHostName ,UserName ,CState=iff(SessionHostOSVersion==\"<>\",\"Failure\",\"Success\"), CorrelationId, TimeGenerated\r\n| join kind= leftouter (\r\n    WVDErrors \r\n) on CorrelationId\r\n| extend DurationFromLogon=datetime_diff(\"Second\",TimeGenerated1,TimeGenerated)\r\n| project  TimeStamp=TimeGenerated, DurationFromLogon, UserName, ResourceAlias ,SessionHost=SessionHostName ,Source ,CodeSymbolic , ErrorMessage=Message, ErrorCode=Code, ErrorSource=Source ,ServiceError, CorrelationId\r\n| order by TimeStamp desc",
        "size": 0,
        "title": "Failed Connections details",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "name": "query - 14 - Copy - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let timeRange=ago(7d);\r\n  SigninLogs\r\n  | where TimeGenerated >= timeRange\r\n  | where AppDisplayName contains \"Windows Virtual Desktop\"\r\n  | where ResultType in ( \"50126\" , \"50020\", \"50034\", \"50074\", \"50076\", \"50131\")\r\n  | extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser\r\n  | extend StatusCode = tostring(Status.errorCode), StatusDetails = tostring(Status.additionalDetails)\r\n  | extend State = tostring(LocationDetails.state), City = tostring(LocationDetails.city)\r\n  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), IPAddresses = makeset(IPAddress), DistinctIPCount = dcount(IPAddress), \r\n  makeset(OS), makeset(Browser), makeset(City), AttemptCount = count() \r\n  by UserDisplayName, UserPrincipalName, AppDisplayName, ResultType, ResultDescription, StatusCode, StatusDetails, Location, State\r\n  | extend timestamp = StartTimeUtc, AccountCustomEntity = UserPrincipalName\r\n  | sort by AttemptCount",
        "size": 0,
        "title": "Access attempts Failed",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 14"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "//To get a list of connections made by your users\r\n\r\nWVDConnections \r\n| project-away TenantId,SourceSystem \r\n| summarize arg_max(TimeGenerated, *), StartTime =  min(iff(State== 'Started', TimeGenerated , datetime(null) )), ConnectTime = min(iff(State== 'Connected', TimeGenerated , datetime(null) ))   by CorrelationId \r\n| join kind=leftouter ( \r\n    WVDErrors \r\n    |summarize Errors=makelist(pack('Code', Code, 'CodeSymbolic', CodeSymbolic, 'Time', TimeGenerated, 'Message', Message ,'ServiceError', ServiceError, 'Source', Source)) by CorrelationId \r\n    ) on CorrelationId     \r\n| join kind=leftouter ( \r\n   WVDCheckpoints \r\n   | summarize Checkpoints=makelist(pack('Time', TimeGenerated, 'Name', Name, 'Parameters', Parameters, 'Source', Source)) by CorrelationId \r\n   | mv-apply Checkpoints on \r\n    ( \r\n        order by todatetime(Checkpoints['Time']) asc \r\n        | summarize Checkpoints=makelist(Checkpoints) \r\n    ) \r\n   ) on CorrelationId \r\n| summarize count() by UserName",
        "size": 1,
        "title": "Top Users",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "sortBy": []
      },
      "customWidth": "33",
      "name": "query - 2 - Copy - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let Events = WVDConnections; \r\nEvents \r\n| where State == \"Connected\" \r\n| project CorrelationId , UserName, ResourceAlias , StartTime=TimeGenerated \r\n| join (Events \r\n| where State == \"Completed\" \r\n| project EndTime=TimeGenerated, CorrelationId) \r\non CorrelationId \r\n| project Duration = EndTime - StartTime, UserName, ResourceAlias \r\n| sort by Duration asc",
        "size": 1,
        "title": "Session Duration per User",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "sortBy": []
      },
      "customWidth": "33",
      "name": "query - 2 - Copy - Copy - Copy - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "//Session logon furation by host pool\r\nWVDConnections \r\n| where Type =~\"WVDConnections\" and State =~ \"Started\" | extend Multi=split(_ResourceId, \"/\") | project ResourceAlias, HostPool=toupper(HP=Multi[8]), SessionHostName , UserName ,CState=iff(SessionHostOSVersion==\"<>\",\"Failure\",\"Success\"), CorrelationId, TimeGenerated, ResourceGroup=Multi[4], DesktopGroup_s=toupper(strcat(RG=Multi[4],\".\", HP=Multi[8])) \r\n| join kind= leftouter (\r\n    WVDCheckpoints \r\n) on CorrelationId\r\n| extend DurationFromLogon=datetime_diff(\"Second\",TimeGenerated1,TimeGenerated)\r\n| where Name=~\"RdpStackLogon\" \r\n| project UserName, ResourceGroup, DesktopGroup_s,SessionHost=SessionHostName, TimeStamp=TimeGenerated1, DurationFromLogon\r\n| summarize DurationInSeconds=avg(DurationFromLogon) by HostPool=DesktopGroup_s \r\n| render columnchart kind=unstacked ",
        "size": 1,
        "title": "Session Duration per Host Pool",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "visualization": "unstackedbar",
        "sortBy": []
      },
      "customWidth": "33",
      "name": "query - 2 - Copy - Copy - Copy - Copy - Copy"
    },
    {
      "type": 1,
      "content": {
        "json": "## Feeds"
      },
      "name": "text - 9 - Copy - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "WVDFeeds  \r\n| project-away TenantId,SourceSystem  \r\n| join kind=leftouter (  \r\n    WVDErrors  \r\n    |summarize Errors=makelist(pack('Code', Code, 'CodeSymbolic', CodeSymbolic, 'Time', TimeGenerated, 'Message', Message ,'ServiceError', ServiceError, 'Source', Source)) by CorrelationId  \r\n    ) on CorrelationId      \r\n| join kind=leftouter (  \r\n   WVDCheckpoints  \r\n   | summarize Checkpoints=makelist(pack('Time', TimeGenerated, 'Name', Name, 'Parameters', Parameters, 'Source', Source)) by CorrelationId  \r\n   | mv-apply Checkpoints on  \r\n    (  \r\n        order by todatetime(Checkpoints['Time']) asc  \r\n        | summarize Checkpoints=makelist(Checkpoints)  \r\n    )  \r\n   ) on CorrelationId  \r\n| project-away CorrelationId1, CorrelationId2  \r\n| order by  TimeGenerated desc",
        "size": 1,
        "title": "Feed Activity",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "name": "query - 2 - Copy"
    },
    {
      "type": 1,
      "content": {
        "json": "## Errors"
      },
      "name": "text - 9"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "WVDErrors",
        "size": 1,
        "title": "All Errors",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "gridSettings": {
          "sortBy": [
            {
              "itemKey": "TimeGenerated",
              "sortOrder": 1
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "TimeGenerated",
            "sortOrder": 1
          }
        ]
      },
      "name": "query - 2 - Copy - Copy - Copy - Copy - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "WVDErrors \r\n| where CodeSymbolic ==\"ErrorSymbolicCode\" \r\n| summarize count(UserName) by CodeSymbolic ",
        "size": 1,
        "title": "Specific Errors",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "sortBy": []
      },
      "name": "query - 2 - Copy - Copy - Copy - Copy - Copy - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "WVDErrors \r\n| where ServiceError ==\"false\" \r\n| summarize usercount = count(UserName) by CodeSymbolic \r\n| sort by usercount desc\r\n| render barchart ",
        "size": 1,
        "title": "Occurrence of an Error Across All Users",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ],
        "sortBy": []
      },
      "name": "query - 2 - Copy - Copy - Copy - Copy - Copy - Copy - Copy"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let timeRange=ago(1h);\r\nlet Threshold = 1;\r\nlet Userlogintomultihostpool =\r\nWVDConnections\r\n| where TimeGenerated >= timeRange \r\n| summarize dcount(_ResourceId)  by UserName\r\n| where dcount__ResourceId  > Threshold\r\n| project UserName ;\r\nWVDConnections\r\n| where TimeGenerated >= timeRange \r\n| where UserName in (Userlogintomultihostpool)\r\n| project  _ResourceId, UserName, ClientIPAddress, ClientType, TenantId, TimeGenerated, Type, SessionHostIPAddress\r\n| sort by UserName asc",
        "size": 0,
        "title": "User trying to log on to multiple host pools",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 15"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let timeRange=ago(7d);\r\nlet RareOperations = dynamic([\"Consent to application\" ,  \"Add delegated permission grant\"]);\r\nAuditLogs \r\n| where TimeGenerated >= timeRange\r\n      | extend ModProps = TargetResources.[0].modifiedProperties\r\n      | extend IpAddress = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)), \r\n      tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), tostring(parse_json(tostring(InitiatedBy.app)).ipAddress))\r\n      | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), \r\n      tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName))\r\n      | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))\r\n      | mvexpand ModProps\r\n      | extend PropertyName = tostring(ModProps.displayName), newValue = replace(\"\\\"\",\"\",tostring(ModProps.newValue))\r\n      | where OperationName in (RareOperations)\r\n      | where TargetResourceName contains \"windows virtual desktop\"\r\n      | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), OperationCount = count() \r\n  by Type, InitiatedBy, IpAddress, TargetResourceName, Category, OperationName, PropertyName, newValue, CorrelationId, Id",
        "size": 0,
        "title": "Azure Audit Operations - WVD",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 16"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "//Administrative activities over time\r\nWVDManagement \r\n| summarize Count=count() by bin(TimeGenerated,15)\r\n| render scatterchart ",
        "size": 0,
        "title": "Administrative activities over time",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{Workspace}"
        ]
      },
      "name": "query - 21"
    }
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}